app/controllers/products_controller.rb

  def create
    @product = Product.create(product_params)
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at", "inventory", "description") VALUES (?, ?, ?, ?, ?, ?)  [["name", "testname"], ["price", 1], ["created_at", "2019-06-30 20:00:13.745807"], ["updated_at", "2019-06-30 20:00:13.745807"], ["inventory", 2], ["description", "test desc"]]